# Data Structure

# 1.-SERIES\
# A Series is a one-dimensional labelled array-like object. 
It is capable of holding any data type, e.g. integers, floats, strings, Python objects, and so on. It can be seen as a data structure with two arrays: one functioning as the index, i.e. the labels, and the other one contains the actual data.

In [11]:
import pandas as pd 
import numpy as np
q=np.linspace(20,30,6)
L=pd.Series(q)
L

0    20.0
1    22.0
2    24.0
3    26.0
4    28.0
5    30.0
dtype: float64

In [9]:
# we can change the indexing also.
import pandas as pd 
import numpy as np
q=np.linspace(20,30,6)
p=np.linspace(20,60,6)
S = pd.Series([11, 28, 72, 3, 5, 8],index=q) 
S

20.0    11
22.0    28
24.0    72
26.0     3
28.0     5
30.0     8
dtype: int64

In [4]:
# We haven't defined an index in our example, but we see two columns in our output: The right column contains our data, whereas the left column contains
#the index. Pandas created a default index starting with 0 going to 5, which is the length of the data minus 1. We can directly access the index and the
#values of our Series S:
print(S.index) 
print(S.values)
print(S[2])
print(S.

RangeIndex(start=0, stop=6, step=1)
[11 28 72  3  5  8]
72

In [33]:
#If we add two series with the same indices, we get a new series with the same index and the correponding values will be added:

fruits = ['apples', 'oranges', 'cherries', 'pears'] 
S = pd.Series([20, 33, 52, 10], index=fruits) 
S2 = pd.Series([17, 13, 31, 32], index=fruits) 
M=S + S2
print("sum of S: ", M)

sum of S:  apples      37
oranges     46
cherries    83
pears       42
dtype: int64

In [22]:
# The indices do not have to be the same for the Series addition. The index will be the "union" of both indices if an index doesn't occur in both Series, the value for this Series will be NaN:
fruit1=['aam','dhatoora','tamatar']
fruit2=['tamatar','dhatoora','amrood']
a=[22,33,44]
a2=[22,35,44]
q=pd.Series(a, index=fruit1)
q2=pd.Series(a2, index=fruit2)
print(q+q2)

aam          NaN
amrood       NaN
dhatoora    68.0
tamatar     66.0
dtype: float64

In [27]:
#In principle, the indices can be completely different, as in the following example. We have two indices. One is the Turkish translation of the English fruit names
fruits = ['apples', 'portakal', 'cherries', 'pears'] 
fruits_tr = ['elma', 'portakal', 'kiraz', 'armut'] 
a=[22,33,44,7]
a2=[22,35,44,0]
q=pd.Series(a, index=fruits)
q2=pd.Series(a2, index=fruits_tr)
d=q+q2
print(d)

apples       NaN
armut        NaN
cherries     NaN
elma         NaN
kiraz        NaN
pears        NaN
portakal    68.0
dtype: float64

In [29]:
print(d['portakal'])
print(d['armut'])

68.0
nan

In [35]:
# if we want to access multiple values of a series then we can pass the list of the index as well.
print(d[['armut','portakal']])

armut        NaN
portakal    68.0
dtype: float64

# PANDAS.SERIES.APPLY

In [38]:
# we can use  many functions on the series after using apply function.
print(S)
S.apply(np.log)

apples      20
oranges     33
cherries    52
pears       10
dtype: int64

apples      2.995732
oranges     3.496508
cherries    3.951244
pears       2.302585
dtype: float64

In [43]:
S.apply(lambda x : x*2 if x>15 else x+10)

apples       40
oranges      66
cherries    104
pears        20
dtype: int64

In [46]:
def rampura(x):
    if x>50:
        print(x+100)
    else:
        print(x)

In [51]:
S.apply(rampura)

20
33
152
10

apples      None
oranges     None
cherries    None
pears       None
dtype: object

In [52]:
# FILTERING WITH A BOOLEAN ARRAY
S[S>30]

oranges     33
cherries    52
dtype: int64

In [54]:
#A series can be seen as an ordered Python dictionary with a fixed length. 
"apples" in S

True

In [60]:
# CREATING SERIES OBJECTS FROM DICTIONARIES We can even use a dictionary to create a Series object. The resulting Series contains the dict's keys as the indices and the values as the values.

cities = {"London": 8615246, "Berlin": 3562166, "Madrid": 3165235, "Rome": 
          2874038, "Paris": 2273305, "Vienna": 1805681, "Bucharest": 1803425, 
          "Hamburg": 1760433, "Budapest": 1754000, "Warsaw": 1740119, "Barcelona": 1602386, 
          "Munich": 1493900, "Milan": 1350680} 
city_series = pd.Series(cities) 
print(city_series)

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
dtype: int64

# NAN - 
MISSING DATA One problem in dealing with data analysis tasks consists in missing data. Pandas makes it as easy as possible to work with missing data.
THE METHODS ISNULL() AND NOTNULL\
We can see, that the cities, which are not included in the dictionary, get the value NaN assigned. NaN stands for "not a number". It can also be seen as meaning "missing" in our example. We can check for missing values with the methods isnull and notnull:

In [61]:
my_cities = ["London", "Paris", "Zurich", "Berlin", "Stuttgart", "Hamburg"] 
my_city_series = pd.Series(cities, index=my_cities) 
my_city_series

London       8615246.0
Paris        2273305.0
Zurich             NaN
Berlin       3562166.0
Stuttgart          NaN
Hamburg      1760433.0
dtype: float64

In [67]:
my_city_series.isnull()

London       False
Paris        False
Zurich        True
Berlin       False
Stuttgart     True
Hamburg      False
dtype: bool

In [68]:
my_city_series.notnull()

London        True
Paris         True
Zurich       False
Berlin        True
Stuttgart    False
Hamburg       True
dtype: bool

In [69]:
#CONNECTION BETWEEN NAN AND NONE We get also a NaN, if a value in the dictionary has a None: 
d = {"a":23, "b":45, "c":None, "d":0} 
S = pd.Series(d) 
print(S)

a    23.0
b    45.0
c     NaN
d     0.0
dtype: float64

In [70]:
pd.notnull(S)

a     True
b     True
c    False
d     True
dtype: bool

# FILTERING OUT MISSING DATA

In [ ]:
print(my_city_series)

print(my_city_series.dropna())

London       8615246.0
Paris        2273305.0
Zurich             NaN
Berlin       3562166.0
Stuttgart          NaN
Hamburg      1760433.0
dtype: float64
London     8615246.0
Paris      2273305.0
Berlin     3562166.0
Hamburg    1760433.0
dtype: float64

# FILLING IN MISSING DATA 

In many cases you don't want to filter out missing data, but you want to fill in appropriate data for the empty gaps. A suitable method in many situations will be fillna:

In [80]:
print(my_city_series.fillna(0))
# this will give float value of fill na so we use astype(int) to convert that float into int
print(my_city_series.fillna(0).astype(int))

London       8615246.0
Paris        2273305.0
Zurich             0.0
Berlin       3562166.0
Stuttgart          0.0
Hamburg      1760433.0
dtype: float64
London       8615246
Paris        2273305
Zurich             0
Berlin       3562166
Stuttgart          0
Hamburg      1760433
dtype: int64

In [75]:
#Okay, that's not what we call "fill in appropriate data for the empty gaps". If we call fillna with a dict, we can provide the appropriate data, i.e. the population of Zurich and Stuttgart:
missing_cities = {"Stuttgart":597939, "Zurich":378884} 
my_city_series.fillna(missing_cities)

London       8615246.0
Paris        2273305.0
Zurich        378884.0
Berlin       3562166.0
Stuttgart     597939.0
Hamburg      1760433.0
dtype: float64

# 2. Dataframe
A DataFrame logically corresponds to a "sheet" of an Excel document. A DataFrame has both a row and a column index.\
Each column consists of a unique data typye, but different columns can have different types, e.g. the first column may consist of integers, while the second one consists of boolean values and so on.\
There is a close connection between the DataFrames and the Series of Pandas. A DataFrame can be seen as a concatenation of Series, each Series having the same index, i.e. the index of the DataFrame.

In [9]:
import pandas as pd
years = range(2014, 2018)
shop1 = pd.Series([2409.14, 2941.01, 3496.83, 3119.55], index=years) 
shop2 = pd.Series([1203.45, 3441.62, 3007.83, 3619.53], index=years) 
shop3 = pd.Series([3412.12, 3491.16, 3457.19, 1963.10], index=years)
print(pd.concat([shop1,shop2,shop3]))

2014    2409.14
2015    2941.01
2016    3496.83
2017    3119.55
2014    1203.45
2015    3441.62
2016    3007.83
2017    3619.53
2014    3412.12
2015    3491.16
2016    3457.19
2017    1963.10
dtype: float64

In [10]:
# if we want to concat all the columns horizontally then axis will have to be passed.
# ValueError: Length of values (3) does not match length of index (4)
print(pd.concat([shop1,shop2,shop3],axis=1))

            0        1        2
2014  2409.14  1203.45  3412.12
2015  2941.01  3441.62  3491.16
2016  3496.83  3007.83  3457.19
2017  3119.55  3619.53  1963.10

# giving names to the columns

In [13]:
import pandas as pd
years = range(2014, 2018)
shop1 = pd.Series([2409.14, 2941.01, 3496.83, 3119.55], index=years) 
shop2 = pd.Series([1203.45, 3441.62, 3007.83, 3619.53], index=years) 
shop3 = pd.Series([3412.12, 3491.16, 3457.19, 1963.10], index=years)
cities = ["Zürich", "Winterthur", "Freiburg"] 
shops_df = pd.concat([shop1, shop2, shop3], axis=1) 
shops_df.columns = cities 
print(shops_df)

       Zürich  Winterthur  Freiburg
2014  2409.14     1203.45   3412.12
2015  2941.01     3441.62   3491.16
2016  3496.83     3007.83   3457.19
2017  3119.55     3619.53   1963.10

In [14]:
# alternative way: give names to series: 
shop1.name = "Zürich"
shop2.name = "Winterthur" 
shop3.name = "Freiburg" 
print("------") 
shops_df2 = pd.concat([shop1, shop2, shop3], axis=1) 
print(shops_df2)

------
       Zürich  Winterthur  Freiburg
2014  2409.14     1203.45   3412.12
2015  2941.01     3441.62   3491.16
2016  3496.83     3007.83   3457.19
2017  3119.55     3619.53   1963.10

# ways to create dataframe
A DataFrame has a row and column index; it's like a dict of Series with a common index.

# 2.1. creating datframe with dictionaries.
To create DataFrame from a dictionary of ndarrays /lists, all the arrays must be of the same length. If an index is passed then the length index should be equal to the length of the arrays.

If no index is passed, then by default, the index will be range(n) where n is the array length.

In [16]:
cities={'name': ['qq','ww','ee'],'pop': ['aaaa','sss','ddd'],'den': ['q','w','e']}
ss=pd.DataFrame(cities)
print(ss)

  name   pop den
0   qq  aaaa   q
1   ww   sss   w
2   ee   ddd   e

In [19]:
#the list of the names of the columns
#  It's possible to get the names of the columns as a list:

ss.columns.values

array(['name', 'pop', 'den'], dtype=object)

# 2.2. creating dataframewith lists inside list.
when we use only list its elements will traverse horizotically in the dataframe.\
To create a Pandas DataFrame from a list of lists, you can use the pd.DataFrame() function. This function takes a list of lists as input and creates a DataFrame with the same number of rows and columns as the input list.

In [21]:
data=[[111,333,444,555],[3533,4444,5555,6666],[1,2,3,4]]
df=pd.DataFrame(data, columns=['q','p','r','s'])
df

      q     p     r     s
0   111   333   444   555
1  3533  4444  5555  6666
2     1     2     3     4

# 2.3. Create DataFrame from List of Dictionaries
Pandas DataFrame can be created by passing lists of dictionaries as input data. By default, dictionary keys will be taken as columns.

In [22]:
# Python code demonstrate how to create
# Pandas DataFrame by lists of dicts.
import pandas as pd

# Initialize data to lists.
data = [{'a': 1, 'b': 2, 'c': 3},
        {'a': 10, 'b': 20, 'c': 30}]

# Creates DataFrame.
df = pd.DataFrame(data)

# Print the data
print(df)

    a   b   c
0   1   2   3
1  10  20  30

# 2.4. Create DataFrame using the zip() function
Two lists can be merged by using the zip() function . Now, create the Pandas DataFrame by calling pd.DataFrame() function.

In [27]:
# Python program to demonstrate creating
# pandas Dataframe from lists using zip.

import pandas as pd

# List1
Name = ['tom', 'krish', 'nick', 'juli']

# List2
Age = [25, 30, 26, 22]

# get the list of tuples from two lists.
# and merge them by using zip().
list_of_tuples = list(zip(Name, Age))

# Assign data to tuples.
list_of_tuples


# Converting lists of tuples into
# pandas Dataframe.
df = pd.DataFrame(list_of_tuples,
                  columns=['Name', 'Age'])

# Print data.
print(df)

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

In [28]:
# Python code demonstrate creating
# pandas DataFrame with indexed by

# DataFrame using arrays.
import pandas as pd

# initialize data of lists.
data = {'Name': ['Tom', 'Jack', 'nick', 'juli'],
        'marks': [99, 98, 95, 90]}

# Creates pandas DataFrame.
df = pd.DataFrame(data, index=['rank1',
                               'rank2',
                               'rank3',
                               'rank4'])

# print the data
print(df)

       Name  marks
rank1   Tom     99
rank2  Jack     98
rank3  nick     95
rank4  juli     90

In [33]:
p=df.Name
print(pd.Series(p))

rank1     Tom
rank2    Jack
rank3    nick
rank4    juli
Name: Name, dtype: object

# 2.5. REARRANGING THE ORDER OF COLUMNS 
We can also define and rearrange the order of the columns at the time of creation of the DataFrame. This makes also sure that we will have a defined ordering of our columns, if we create the DataFrame from a
dictionary. Dictionaries are not ordered, as you have seen in our chapter onDictionariesin our Python tutorial, so we cannot know in advance what the ordering of our columns will be:

In [35]:
city_frame = pd.DataFrame(cities, columns=["name", "country", "population","idk"]) 
city_frame

  name country population  idk
0   qq     NaN        NaN  NaN
1   ww     NaN        NaN  NaN
2   ee     NaN        NaN  NaN

In [36]:
#We change both the column order and the ordering of the index with the function reindex with the following code:
city_frame.reindex(index=[0, 2, 4, 6, 8, 10, 12, 1, 3, 5, 7, 9, 11],
columns=['country', 'name', 'population'])

   country name population
0      NaN   qq        NaN
2      NaN   ee        NaN
4      NaN  NaN        NaN
6      NaN  NaN        NaN
8      NaN  NaN        NaN
10     NaN  NaN        NaN
12     NaN  NaN        NaN
1      NaN   ww        NaN
3      NaN  NaN        NaN
5      NaN  NaN        NaN
7      NaN  NaN        NaN
9      NaN  NaN        NaN
11     NaN  NaN        NaN

In [38]:
#Now, we want to rename our columns. For this purpose, we will use the DataFrame method 'rename'. This method supports two calling conventions
city_frame.rename(columns={"name":"Soyadı", "country":"Ülke",
"population":"Nüfus"}, 
                  inplace=True)
city_frame

  Soyadı Ülke Nüfus  idk
0     qq  NaN   NaN  NaN
1     ww  NaN   NaN  NaN
2     ee  NaN   NaN  NaN

# EXISTING COLUMN AS THE INDEX OF A DATAFRAME 
We want to create a more useful index in the following example. We will use the country name as the index, i.e. the list value associated to the key "country" of our cities dictionary:

In [45]:
cities = {"name": ["London", "Berlin", "Madrid", "Rome", "Paris", "Vienna", "Bucharest", "Hamburg", 
                   "Budapest", "Warsaw", "Barcelona", "Munich", "Milan"], "population": 
          [8615246, 3562166, 3165235, 2874038, 2273305, 1805681, 1803425, 1760433, 1754000,
           1740119, 1602386, 1493900, 1350680], "country": ["England", "Germany", "Spain", 
                                                            "Italy", "France", "Austria", "Romania", "Germany", "Hungary", 
                                                            "Poland", "Spain", "Germany", "Italy"]}
city_frame = pd.DataFrame(cities)
city_frame

         name  population  country
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12      Milan     1350680    Italy

In [43]:
city_frame = pd.DataFrame(cities, columns=["name", "population"], index=cities["country"]) 
city_frame

KeyError: 'country'

In [46]:
#Alternatively, we can change an existing DataFrame. We can us the method set_index to turn a column into an index. "set_index" does not work in-place, it returns a new data frame with the chosen column as the index:
city_frame = pd.DataFrame(cities) 
city_frame2 = city_frame.set_index("country") 
print(city_frame2)

              name  population
country
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [47]:
# RETRIEVING THE COLUMN NAMES It's possible to get the names of the columns as a list:
city_frame.columns.values

array(['name', 'population', 'country'], dtype=object)

In [48]:
# CUSTOM INDEX 
ordinals = ["first", "second", "third", "fourth", "fifth", "sixth", "seventh", "eigth", "ninth", "tenth", "eleventh", "twelvth", "thirteenth"] 
city_frame = pd.DataFrame(cities, index=ordinals) 
city_frame

                 name  population  country
first          London     8615246  England
second         Berlin     3562166  Germany
third          Madrid     3165235    Spain
fourth           Rome     2874038    Italy
fifth           Paris     2273305   France
sixth          Vienna     1805681  Austria
seventh     Bucharest     1803425  Romania
eigth         Hamburg     1760433  Germany
ninth        Budapest     1754000  Hungary
tenth          Warsaw     1740119   Poland
eleventh    Barcelona     1602386    Spain
twelvth        Munich     1493900  Germany
thirteenth      Milan     1350680    Italy

In [51]:
# Alternatively, we can change an existing DataFrame. We can us the method set_index to turn a column into an index. 
#"set_index" does not work in-place, it returns a new data frame with the chosen column as the index:
city_frame = pd.DataFrame(cities) 
city_frame2 = city_frame.set_index("country") 
print(city_frame2)
#We saw in the previous example that the set_index method returns a new DataFrame object and doesn't change the original DataFrame. 
#If we set the optional parameter "inplace" to True, the DataFrame will be changed in place, i.e. no new object will be created:

              name  population
country
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

# 2.6. accessing row elements (locators 'loc' and 'iloc'.)
only works on the row index but not any other element of the index.\
*iloc= will only take real either vis|ible or imaginary index(2,4,5,-1)\
*loc= this can take the name of the row be it a numeric value or be it a name.

In [80]:
print('city_frame2------------------------------------------------------------------ ')
print(city_frame2)
print(' ')
print('city_frame------------------------------------------------------------------')
print(city_frame)
print('------------------------------------------------------------------')
# print(pd.concat([city_frame2,city_frame],axis=1, index=range(1,14)))

city_frame2------------------------------------------------------------------
              name  population
country
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

city_frame------------------------------------------------------------------
         name  population  country
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12      Milan     1350680    Italy
------------------------------------------------------------------

In [138]:
print(city_frame2.loc['Germany'])
print(city_frame2.loc['Germany'])

        name  population
country
Germany   BB           0
Germany   BB           0
Germany   BB           0
        name  population
country
Germany   BB           0
Germany   BB           0
Germany   BB           0

In [84]:
print(city_frame2.iloc[2])

name           Madrid
population    3165235
Name: Spain, dtype: object

In [85]:
# It is also possible to simultaneously extracting rows by chosen more than on index labels. To do this we use a list of indices:
print(city_frame2.loc[["Germany", "France"]])

            name  population
country
Germany   Berlin     3562166
Germany  Hamburg     1760433
Germany   Munich     1493900
France     Paris     2273305

In [90]:
# We will also need to select pandas DataFrame rows based on conditions, which are applied to column values. We can use the operators '>', '=', '=', 
#'<=', '!=' for this purpose. We select all cities with a population of more than two million in the following example:
condition = city_frame.population>2000000
print(condition.sum())

5

In [91]:
# We can use this Boolean DataFrame condition with loc to finally create the selection: 
print(city_frame.loc[condition])

     name  population  country
0  London     8615246  England
1  Berlin     3562166  Germany
2  Madrid     3165235    Spain
3    Rome     2874038    Italy
4   Paris     2273305   France

In [92]:
# It is also possible to logically combine more than one condition with & and | : 
condition1 = (city_frame.population>1500000) 
condition2 = (city_frame['name'].str.contains("m")) 
print(city_frame.loc[condition1 & condition2])

      name  population  country
3     Rome     2874038    Italy
7  Hamburg     1760433  Germany

In [93]:
# We use a logical or | in the following example to see all cities of the Pandas DataFrame, where either the city name contains the letter 'm' or the population number is greater than three million:
condition1 = (city_frame.population>3000000) 
condition2 = (city_frame['name'].str.contains("m")) 
print(city_frame.loc[condition1 | condition2])

      name  population  country
0   London     8615246  England
1   Berlin     3562166  Germany
2   Madrid     3165235    Spain
3     Rome     2874038    Italy
7  Hamburg     1760433  Germany

# adding a new row to the dataframe.

In [94]:
city_frame

         name  population  country
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12      Milan     1350680    Italy

In [109]:
city_frame.iloc[-1] = ['hola', 415215, 'Zurich']
city_frame

         name  population  country
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12       hola      415215   Zurich

In [115]:
# all values of germany has been displaced with new values since Germany index already exists so no new row got added. 
city_frame2.loc['Germany'] = ['BB', 0000] 
city_frame2

                  name  population
country
England         London     8615246
Germany             BB           0
Spain           Madrid     3165235
Italy             Rome     2874038
France           Paris     2273305
Austria         Vienna     1805681
Romania      Bucharest     1803425
Germany             BB           0
Hungary       Budapest     1754000
Poland          Warsaw     1740119
Spain        Barcelona     1602386
Germany             BB           0
Italy            Milan     1350680
Switzerland     Zurich      415215

In [116]:
#ACCESSING ROWS BY POSITION The iloc method of a Pandas DataFrame object can be used to select rows and columns by number, i.e. in the order that they appear in the data frame. iloc allows selections of the rows, as if they were numbered by integers 0 , 1 , 2 , .... We demonstrate this in the following example:
df = city_frame.iloc[3] 
print(df)

name             Rome
population    2874038
country         Italy
Name: 3, dtype: object

In [117]:
df = city_frame.iloc[[3, 2, 0, 5, 0]] 
print(df)

     name  population  country
3    Rome     2874038    Italy
2  Madrid     3165235    Spain
0  London     8615246  England
5  Vienna     1805681  Austria
0  London     8615246  England

# SUM AND CUMULATIVE SUM 
The DataFrame object of Pandas provides a method to sum both columns and rows.

In [124]:
import numpy as np
years = range(2014, 2019) 
cities = ["Zürich", "Freiburg", "München", "Konstanz", "Saarbrücke n"] 
shops = pd.DataFrame(index=years) 
for city in cities: 
    shops.insert(loc=len(shops.columns), column=city, value=(np.random.uniform(0.7, 1, (5,)) * 1000).round(2)) 
print(shops)

      Zürich  Freiburg  München  Konstanz  Saarbrücke n
2014  959.98    879.51   790.61    833.86        722.71
2015  817.78    917.12   854.59    769.95        868.12
2016  835.92    820.23   824.61    926.29        861.93
2017  784.41    888.28   944.49    778.11        826.40
2018  978.66    742.14   932.32    742.05        954.29

In [122]:
#Let's apply sum to the DataFrame shops :
shops.sum()
# by default axis is 0

Zürich          3934.55
Freiburg        4206.61
München         4323.18
Konstanz        4091.26
Saarbrücke n    4075.54
dtype: float64

In [123]:
shops.sum(axis=1)

2014    3930.29
2015    3760.35
2016    4795.26
2017    4040.43
2018    4104.81
dtype: float64

In [125]:
# i only want the sum of 1,3 and 5th row.
shops

      Zürich  Freiburg  München  Konstanz  Saarbrücke n
2014  959.98    879.51   790.61    833.86        722.71
2015  817.78    917.12   854.59    769.95        868.12
2016  835.92    820.23   824.61    926.29        861.93
2017  784.41    888.28   944.49    778.11        826.40
2018  978.66    742.14   932.32    742.05        954.29

In [144]:
import pandas as pd
p=shops.loc[[2015,2016,2018]]
p

      Zürich  Freiburg  München  Konstanz  Saarbrücke n
2015  817.78    917.12   854.59    769.95        868.12
2016  835.92    820.23   824.61    926.29        861.93
2018  978.66    742.14   932.32    742.05        954.29

In [146]:
pp=shops.iloc[[0,-2,-1]]
pp

      Zürich  Freiburg  München  Konstanz  Saarbrücke n
2014  959.98    879.51   790.61    833.86        722.71
2017  784.41    888.28   944.49    778.11        826.40
2018  978.66    742.14   932.32    742.05        954.29

In [147]:
pp.sum()

Zürich          2723.05
Freiburg        2509.93
München         2667.42
Konstanz        2354.02
Saarbrücke n    2503.40
dtype: float64

In [149]:
shops[["Zürich", "München", "Saarbrücke n"]].sum()

Zürich          4376.75
München         4346.62
Saarbrücke n    4233.45
dtype: float64

In [150]:
x = shops.cumsum() 
print(x)

       Zürich  Freiburg  München  Konstanz  Saarbrücke n
2014   959.98    879.51   790.61    833.86        722.71
2015  1777.76   1796.63  1645.20   1603.81       1590.83
2016  2613.68   2616.86  2469.81   2530.10       2452.76
2017  3398.09   3505.14  3414.30   3308.21       3279.16
2018  4376.75   4247.28  4346.62   4050.26       4233.45

In [157]:
shops1 = pd.DataFrame(shops, columns=["country", "population", "cum_population"], index=years) 
shops1

      country  population  cum_population
2014      NaN         NaN             NaN
2015      NaN         NaN             NaN
2016      NaN         NaN             NaN
2017      NaN         NaN             NaN
2018      NaN         NaN             NaN

In [161]:
x

       Zürich  Freiburg  München  Konstanz  Saarbrücke n
2014   959.98    879.51   790.61    833.86        722.71
2015  1777.76   1796.63  1645.20   1603.81       1590.83
2016  2613.68   2616.86  2469.81   2530.10       2452.76
2017  3398.09   3505.14  3414.30   3308.21       3279.16
2018  4376.75   4247.28  4346.62   4050.26       4233.45

In [12]:
import numpy as np
import pandas as pd
years = range(2014, 2019) 
cities = ["Zürich", "Freiburg", "München", "Konstanz", "Saarbrücke n"] 
shops = pd.DataFrame(index=years) 
for city in cities: 
    shops.insert(loc=len(shops.columns), column=city, value=(np.random.uniform(0.7, 1, (5,)) * 1000).round(2)) 
print(shops)

      Zürich  Freiburg  München  Konstanz  Saarbrücke n
2014  912.74    779.65   938.43    802.64        794.25
2015  872.19    978.51   922.12    939.55        789.23
2016  765.55    751.46   797.48    959.24        834.08
2017  710.53    887.46   714.50    977.11        920.91
2018  969.46    804.08   838.50    948.87        857.74

In [19]:
# We can also include a column name which is not contained in the dictionary, when we create the DataFrame from the di values of this column will be set to NaN:
city_frame = pd.DataFrame(shops, columns=['Zürich','Freiburg','München','Konstanz','Saarbrücke n',':)'])
print(city_frame)

      Zürich  Freiburg  München  Konstanz  Saarbrücke n  :)
2014  912.74    779.65   938.43    802.64        794.25 NaN
2015  872.19    978.51   922.12    939.55        789.23 NaN
2016  765.55    751.46   797.48    959.24        834.08 NaN
2017  710.53    887.46   714.50    977.11        920.91 NaN
2018  969.46    804.08   838.50    948.87        857.74 NaN

# 2.7. accessing column elements
There are two ways to access a column of a DataFrame. The result is in both cases a Series:

In [22]:
# in a dictionary-like way: 
print(city_frame[":)"])

2014   NaN
2015   NaN
2016   NaN
2017   NaN
2018   NaN
Name: :), dtype: float64

In [24]:
# as an attribute 
print(city_frame.Freiburg)

2014    779.65
2015    978.51
2016    751.46
2017    887.46
2018    804.08
Name: Freiburg, dtype: float64

# ASSIGNING NEW VALUES TO A COLUMN

The column :) is still not defined. We can set all elements of the column to the same value:

In [32]:
import numpy as np
city_frame[':)']=range(10,15)
city_frame['Konstanz']=1000
print(city_frame)

      Zürich  Freiburg  München  Konstanz  Saarbrücke n  :)
2014  912.74    779.65   938.43      1000        794.25  10
2015  872.19    978.51   922.12      1000        789.23  11
2016  765.55    751.46   797.48      1000        834.08  12
2017  710.53    887.46   714.50      1000        920.91  13
2018  969.46    804.08   838.50      1000        857.74  14

In [35]:
München = [1572, 891.85, 605.77, 1285, 105.4] 
city_frame['Konstanz']=München
city_frame

      Zürich  Freiburg  München  Konstanz  Saarbrücke n  :)
2014  912.74    779.65   938.43   1572.00        794.25  10
2015  872.19    978.51   922.12    891.85        789.23  11
2016  765.55    751.46   797.48    605.77        834.08  12
2017  710.53    887.46   714.50   1285.00        920.91  13
2018  969.46    804.08   838.50    105.40        857.74  14

# SORTING DATAFRAMES 
Let's sort our DataFrame according to the

In [36]:
city_frame = city_frame.sort_values(by="München", ascending=False) 
print(city_frame)

      Zürich  Freiburg  München  Konstanz  Saarbrücke n  :)
2014  912.74    779.65   938.43   1572.00        794.25  10
2015  872.19    978.51   922.12    891.85        789.23  11
2018  969.46    804.08   838.50    105.40        857.74  14
2016  765.55    751.46   797.48    605.77        834.08  12
2017  710.53    887.46   714.50   1285.00        920.91  13

# INSERTING NEW COLUMNS INTO EXISTING DATAFRAMES 
In the previous example we have added the column area at creation time. Quite often it will be necessary to add or insert columns into existing DataFrames. For this purpose the DataFrame class provides a method "insert", which allows us to insert a column into a DataFrame at a specified location:

In [40]:
idx = 6 
city_frame.insert(loc=idx, column='area',value=range(11,16))
city_frame

      Zürich  Freiburg  München  Konstanz  Saarbrücke n  :)  area
2014  912.74    779.65   938.43   1572.00        794.25  10    11
2015  872.19    978.51   922.12    891.85        789.23  11    12
2018  969.46    804.08   838.50    105.40        857.74  14    13
2016  765.55    751.46   797.48    605.77        834.08  12    14
2017  710.53    887.46   714.50   1285.00        920.91  13    15

# FILLING A DATAFRAME WITH RANDOM VALUES:

In [37]:
import numpy as np 
names = ['Frank', 'Eve', 'Stella', 'Guido', 'Lara'] 
index = ["January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"] 
df = pd.DataFrame((np.random.randn(12, 5)*1000).round(2), columns=names, index=index)
df

             Frank      Eve   Stella    Guido     Lara
January      46.55   270.63   289.86   951.86  1360.89
February   -515.67  -885.16    26.64  -447.91   207.36
March     -1496.88  1494.73  2256.85  1114.70   -37.56
April      2325.28 -1398.63   288.66 -2287.56   305.45
May         131.27   233.05  -679.40 -2111.34   404.73
June       1430.54   670.91  1985.18   471.81  -194.26
July       -937.10  1422.69 -1654.08  -966.35 -1549.67
August     1566.27  -953.95  1140.25  1016.89   -57.34
September  1783.20 -1345.21   420.88  -762.99  -260.71
October     696.52  -266.45 -1186.85  -842.81   324.39
November   -584.00    64.06 -1163.81  -632.31   395.82
December   -203.27 -1089.85  1472.37 -1666.38  1814.58

In [44]:
# transposing a dataframe
o=df.T
o

,January,February,March,April,May,June,July,August,September,October,November,December
Frank,46.55,-515.67,-1496.88,2325.28,131.27,1430.54,-937.10,1566.27,1783.20,696.52,-584.00,-203.27
Eve,270.63,-885.16,1494.73,-1398.63,233.05,670.91,1422.69,-953.95,-1345.21,-266.45,64.06,-1089.85
Stella,289.86,26.64,2256.85,288.66,-679.40,1985.18,-1654.08,1140.25,420.88,-1186.85,-1163.81,1472.37
Guido,951.86,-447.91,1114.70,-2287.56,-2111.34,471.81,-966.35,1016.89,-762.99,-842.81,-632.31,-1666.38
Lara,1360.89,207.36,-37.56,305.45,404.73,-194.26,-1549.67,-57.34,-260.71,324.39,395.82,1814.58

In [45]:
growth_frame2 = o.reindex(["Lara", "Italy", "Germany", "Greece"]) 
print(growth_frame2)

         January  February  March   April     May    June     July  August  \
Lara     1360.89    207.36 -37.56  305.45  404.73 -194.26 -1549.67  -57.34
Italy        NaN       NaN    NaN     NaN     NaN     NaN      NaN     NaN
Germany      NaN       NaN    NaN     NaN     NaN     NaN      NaN     NaN
Greece       NaN       NaN    NaN     NaN     NaN     NaN      NaN     NaN

         September  October  November  December
Lara       -260.71   324.39    395.82   1814.58
Italy          NaN      NaN       NaN       NaN
Germany        NaN      NaN       NaN       NaN
Greece         NaN      NaN       NaN       NaN

# 3. Accessing and Changing values of DataFrames[ loc , at and replace ]
 This chapter of our Pandas and Python tutorial will show various ways to access and change selectively values in Pandas DataFrames and Series. We will show ways how to change single value or values matching strings or regular expressions.

In [48]:
import pandas as pd 
first = ('Mike', 'Dorothee', 'To m', 'Bill', 'Pete', 'Kate') 
last = ('Meyer', 'Maier', 'Meyer', 'Mayer', 'Meyr', 'Mair') 
job = ('data analyst', 'programmer', 'computer scientist', 'data scientist', 'accountant', 'psychiatrist') 
language = ('Python', 'Perl', 'Java', 'Java', 'Cobol', 'Brainfuc k') 
df = pd.DataFrame(list(zip(last, job, language)), columns =['last', 'job', 'language'], index=first) 
df

           last                 job    language
Mike      Meyer        data analyst      Python
Dorothee  Maier          programmer        Perl
To m      Meyer  computer scientist        Java
Bill      Mayer      data scientist        Java
Pete       Meyr          accountant       Cobol
Kate       Mair        psychiatrist  Brainfuc k

# changing adat in the dataframe

In [52]:
# Pandas provides two ways, i.e. loc and at , to access or change a single value of a DataFrame. 
# We will experiment with the height of Bill in the following Python code:
# When it comes to speed the answer is clear: we should definitely use at .
df.at['Pete','job']

'accountant'

In [53]:
df.loc['Bill','language']

'Java'

In [57]:
df.loc['Pete','language']='sanskrit'
#or df.at['Pete','language']='sanskrit'
df

           last                 job    language
Mike      Meyer        data analyst      Python
Dorothee  Maier          programmer        Perl
To m      Meyer  computer scientist        Java
Bill      Mayer      data scientist        Java
Pete       Meyr          accountant    sanskrit
Kate       Mair        psychiatrist  Brainfuc k

# REPLACE
This method replaces values given in to_replace with value . This differs from updating with .loc or .iloc , which requires you to specify a location to update with some value. With replace it is possible to replace values in a Series or DataFrame without knowing where they occur.\
replace works both with Series and DataFrames.\
We will explain the way of working of the method replace by discussing the different data types of the parameter to_replace individually:

In [76]:
s = pd.Series([27, 33, 13, 19]) 
s.replace(13, 42)

0    27
1    33
2    42
3    19
dtype: int64

In [77]:
# If we really want to change the object s is referencing, we should set the inplace parameter to True : 
s = pd.Series([27, 33, 13, 19]) 
s.replace(13, 42, inplace=True) 
s

0    27
1    33
2    42
3    19
dtype: int64

In [78]:
# We can also change multiple values into one single value, as you can see in the following example.
s = pd.Series([0, 1, 2, 3, 4]) 
s.replace([0, 1, 2], 42, inplace=True) 
s

0    42
1    42
2    42
3     3
4     4
dtype: int64

# to_replace
 If both the values of to_replace and value are both lists, they must be the same length.

In [83]:
import pandas as pd 
first = ('Mike', 'Dorothee', 'Tom', 'Bill', 'Pete', 'Kate') 
last = ('Meyer', 'Maier', 'Meyer', 'Mayer', 'Meyr', 'Mair') 
job = ('data analyst', 'programmer', 'computer scientist', 'data scientist', 'programmer', 'psychiatrist') 
language = ('Python', 'Perl', 'Java', 'Pithon', 'Pythen', 'Brainfu ck')
df = pd.DataFrame(list(zip(last, job, language)), columns =['last', 'job', 'language'], index=first) 
df

           last                 job    language
Mike      Meyer        data analyst      Python
Dorothee  Maier          programmer        Perl
Tom       Meyer  computer scientist        Java
Bill      Mayer      data scientist      Pithon
Pete       Meyr          programmer      Pythen
Kate       Mair        psychiatrist  Brainfu ck

In [84]:
df.replace(to_replace=['Maier','Meyr','Mair'], value=['Michael', 'Thomas', 'Python'], inplace=True)
df

             last                 job    language
Mike        Meyer        data analyst      Python
Dorothee  Michael          programmer        Perl
Tom         Meyer  computer scientist        Java
Bill        Mayer      data scientist      Pithon
Pete       Thomas          programmer      Pythen
Kate       Python        psychiatrist  Brainfu ck

# pad , ffill , bfill , None 
ffill= forward fill\
bfill= backward fill

In [85]:
import pandas as pd 
fdf = pd.DataFrame({ 'name':['Ben', 'Kate', 'Agnes', 'Ashleigh', 'Tom'], 'job':['programmer', 'NN', 'NN', 'engineer', 'teacher'], 'language':['Java', 'Python', 'LN', 'LN', 'C']})
fdf

       name         job language
0       Ben  programmer     Java
1      Kate          NN   Python
2     Agnes          NN       LN
3  Ashleigh    engineer       LN
4       Tom     teacher        C

In [96]:
fdf.replace(to_replace=['NN','LN'], value=None, method='bfill')

C:\Users\Education\AppData\Local\Temp\ipykernel_101672\3509581906.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  fdf.replace(to_replace=['NN','LN'], value=None, method='bfill')

       name         job language
0       Ben  programmer     Java
1      Kate    engineer   Python
2     Agnes    engineer        C
3  Ashleigh    engineer        C
4       Tom     teacher        C

# OTHER EXAMPLES 
We will present some more examples, which are taken from the help file of loc :

In [71]:
df1 = pd.DataFrame([[1, 2], [4, 5], [7, 8]], index=['cobra', 'viper', 'sidewinder'], columns=['max_speed', 'shield'])
df1

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [59]:
df.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [60]:
df.loc[['viper', 'sidewinder']]

            max_speed  shield
viper               4       5
sidewinder          7       8

In [61]:
df.loc['cobra', 'shield']

np.int64(2)

In [62]:
df.loc['cobra':'sidewinder', 'max_speed'] 
#Slice with labels for row and single label for column. As mentioned above, note that both the start and stop of the slice are included.

cobra         1
viper         4
sidewinder    7
Name: max_speed, dtype: int64

In [67]:
# Set value for rows matching callable condition
df.loc[df['shield'] > 35] = 0 
df

            max_speed  shield
cobra               1       2
viper               0       0
sidewinder          0       0

In [69]:
df.loc['cobra'] = 10 
df

            max_speed  shield
cobra              10      10
viper               0       0
sidewinder          0       0

In [72]:
df1

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [75]:
df1.loc[lambda df1: df1['shield'] == 8]

            max_speed  shield
sidewinder          7       8

# 4. Pandas: groupby
Pandas groupby operation involves some combination of splitting the object, applying a function, and combining the results. We can split a DataFrame object into groups based on various criteria and row and column-wise, i.e. using axis .
'Applying' means\
• to filter the data,\
• transform the data or\
• aggregate the data.\
groupby can be applied to Pandas Series objects and DataFrame objects!

In [106]:
import pandas as pd 
beverages = pd.DataFrame({'Name': ['Roberta', 'Melinda', 'Brenda', 'Samantha', 'Melinda', 'Roberta', 'Melinda', 'Brenda', 'Samantha'], 
                          'Coffee': [3, 0, 2, 2, 0, 2, 0, 1, 3], 'Tea': [0, 4, 2, 0, 3, 0, 3, 2, 0]}) 
beverages

       Name  Coffee  Tea
0   Roberta       3    0
1   Melinda       0    4
2    Brenda       2    2
3  Samantha       2    0
4   Melinda       0    3
5   Roberta       2    0
6   Melinda       0    3
7    Brenda       1    2
8  Samantha       3    0

In [109]:
# total coffee
beverages['Coffee'].sum()

np.int64(13)

In [110]:
beverages[['Coffee', 'Tea']].sum()

Coffee    13
Tea       14
dtype: int64

In [112]:
beverages.groupby(["Name"]).sum()

          Coffee  Tea
Name
Brenda         3    4
Melinda        0   10
Roberta        5    0
Samantha       5    0

In [113]:
beverages.groupby(["Name"]).mean()

          Coffee       Tea
Name
Brenda       1.5  2.000000
Melinda      0.0  3.333333
Roberta      2.5  0.000000
Samantha     2.5  0.000000

In [115]:
import pandas as pd 
d = {"products": ["Oppilume", "Dreaker", "Lotadilo", "Crosteron", "Wazzasoft", "Oppilume", "Dreaker", "Lotadilo", "Wazzasoft"], 
     "colours": ["blue", "blue", "blue", "green", "blue", "green", "green", "green", "red"], "customer_price": 
     [2345.89, 2390.50, 1820.00, 3100.00, 1784.50, 2545.89, 2590.50, 2220.00, 2084.50], "non_customer_price": 
     [2445.89, 2495.50, 1980.00, 3400.00, 1921.00, 2645.89,2655.50, 2140.00, 2190.00]} 
product_prices = pd.DataFrame(d) 
product_prices

    products colours  customer_price  non_customer_price
0   Oppilume    blue         2345.89             2445.89
1    Dreaker    blue         2390.50             2495.50
2   Lotadilo    blue         1820.00             1980.00
3  Crosteron   green         3100.00             3400.00
4  Wazzasoft    blue         1784.50             1921.00
5   Oppilume   green         2545.89             2645.89
6    Dreaker   green         2590.50             2655.50
7   Lotadilo   green         2220.00             2140.00
8  Wazzasoft     red         2084.50             2190.00

In [122]:
#Calculate the average prices of the products of the following DataFrame:
product_prices.groupby("products").mean()

TypeError: agg function failed [how->mean,dtype->object]

In [123]:
product_prices.groupby("colours").sum()

                                 products  customer_price  non_customer_price
colours
blue     OppilumeDreakerLotadiloWazzasoft         8340.89             8842.39
green    CrosteronOppilumeDreakerLotadilo        10456.39            10841.39
red                             Wazzasoft         2084.50             2190.00

In [124]:
# if we have an index column and we want to group it by index then we'll use (df.index) inside groupby function.

In [125]:
# we can pass multiple values inside groupby function whoch will be a list.
product_prices.groupby(["colours","products"]).sum()

                   customer_price  non_customer_price
colours products
blue    Dreaker           2390.50             2495.50
        Lotadilo          1820.00             1980.00
        Oppilume          2345.89             2445.89
        Wazzasoft         1784.50             1921.00
green   Crosteron         3100.00             3400.00
        Dreaker           2590.50             2655.50
        Lotadilo          2220.00             2140.00
        Oppilume          2545.89             2645.89
red     Wazzasoft         2084.50             2190.00

# 5. READING AND WRITING DATA
 it also needs functions which support the most important data formats like \
 • Delimiter-separated files, like e.g. csv\
 • Microsoft Excel files\
 • HTML\
 • XML \
 • JSON

# 5.1 DELIMITER-SEPARATED VALUES 
Most people take csv files as a synonym for delimterseparated values files. They leave the fact out of account that csv is an acronym for "comma separated values", which is not the case in many situations. Pandas also uses "csv" and contexts, in which "dsv" would be more appropriate. 
 They leave the fact out of account that csv is an acronym for "comma separated values", which is not the case in many situations. Pandas also uses "csv" and contexts, in which "dsv" would be more appropriate.

# READING CSV AND DSV FILES Pandas
offers two ways to read in CSV or DSV files to be precise: \
• DataFrame.from_csv \
• read_csv\
We will focus on read_csv, because DataFrame.from_csv is kept inside Pandas for reasons of backwards compatibility.

In [7]:
import pandas as pd 
example = pd.read_csv(r"C:\Users\Education\Downloads\project_7_python_data.csv") 
example.head()

,course_id,course_title,is_paid,price,num_subscribers,num_reviews,num_lectures,level,content_duration,published_timestamp,subject
0,288942,#1 Piano Hand Coordination: Play 10th Ballad i...,True,35,3137,18,68,All Levels,1.5 hours,2014-09-18T05:07:05Z,Musical Instruments
1,1170074,#10 Hand Coordination - Transfer Chord Ballad ...,True,75,1593,1,41,Intermediate Level,1 hour,2017-04-12T19:06:34Z,Musical Instruments
2,1193886,#12 Hand Coordination: Let your Hands dance wi...,True,75,482,1,47,Intermediate Level,1.5 hours,2017-04-26T18:34:57Z,Musical Instruments
3,1116700,#4 Piano Hand Coordination: Fun Piano Runs in ...,True,75,850,3,43,Intermediate Level,1 hour,2017-02-21T23:48:18Z,Musical Instruments
4,1120410,#5 Piano Hand Coordination: Piano Runs in 2 ...,True,75,940,3,32,Intermediate Level,37 mins,2017-02-21T23:44:49Z,Musical Instruments

As we can see, read_csv used automatically the first line as the names for the columns. It is possible to give other names to the columns. For this purpose, we have to skip the first line by setting the parameter "header" to 0 and we have to assign a list with the column names to the parameter "names":

In [8]:
example = pd.read_csv(r"C:\Users\Education\Downloads\project_7_python_data.csv",header=0,names=['o','p','q','r','s','t','u','v','w','x','y'])

In [9]:
example.head(5)

,o,p,q,r,s,t,u,v,w,x,y
0,288942,#1 Piano Hand Coordination: Play 10th Ballad i...,True,35,3137,18,68,All Levels,1.5 hours,2014-09-18T05:07:05Z,Musical Instruments
1,1170074,#10 Hand Coordination - Transfer Chord Ballad ...,True,75,1593,1,41,Intermediate Level,1 hour,2017-04-12T19:06:34Z,Musical Instruments
2,1193886,#12 Hand Coordination: Let your Hands dance wi...,True,75,482,1,47,Intermediate Level,1.5 hours,2017-04-26T18:34:57Z,Musical Instruments
3,1116700,#4 Piano Hand Coordination: Fun Piano Runs in ...,True,75,850,3,43,Intermediate Level,1 hour,2017-02-21T23:48:18Z,Musical Instruments
4,1120410,#5 Piano Hand Coordination: Piano Runs in 2 ...,True,75,940,3,32,Intermediate Level,37 mins,2017-02-21T23:44:49Z,Musical Instruments

#pop = pd.read_csv("data1/countries_population.csv", header=None, names=["Country", "Population"], index_col=0, quotechar="'", sep=" ", thousands=",")
# saving a csv file

We can create csv (or dsv) files with the method "to_csv".

In [ ]:
# population.to_csv("data1/countries_total_population.csv")

In [11]:
import pandas as pd 
shop1 = {"foo":{2010:23, 2011:25}, "bar":{2010:13, 2011:29}} 
shop2 = {"foo":{2010:223, 2011:225}, "bar":{2010:213, 2011:229}} 
shop1 = pd.DataFrame(shop1) 
shop2 = pd.DataFrame(shop2)
both_shops = shop1 + shop2 
print("Sales of shop1:\n", shop1) 
print("\nSales of both shops\n", both_shops)

Sales of shop1:
       foo  bar
2010   23   13
2011   25   29

Sales of both shops
       foo  bar
2010  246  226
2011  250  258

In [12]:
shops = pd.concat([shop1, shop2], axis=1) 
shops

      foo  bar  foo  bar
2010   23   13  223  213
2011   25   29  225  229

In [15]:
shops.to_csv("data1countries_total_population.csv") 
#file successfully saved

# 5.2 reading and writing excel file
It is also possible to read and write Microsoft Excel files. The Pandas functionalities to read and write Excel files use the modules 'xlrd' and 'openpyxl'. These modules are not automatically installed by Pandas, so you may have to install them manually!

In [21]:
excel_file = pd.ExcelFile(r"C:\Users\Education\Documents\Book1.csv") 
sheet = pd.read_excel(excel_file) 
sheet

ValueError: Excel file format cannot be determined, you must specify an engine manually.

In [22]:
# saving
# average.to_excel(writer,'average') 
# writer.save() 
# writer.close()

# 6. NaN value
This standard added NaN to the arithmetic formats: "arithmetic formats: sets of binary and decimal floating-point data, which consist of finite numbers (including signed zeros and subnormal numbers), infinities, and special 'not a number' values (NaNs)"
'NAN' IN PYTHON Python knows NaN values as well. We can create it with 
"float":

In [23]:
n1 = float("nan") 
n2 = float("Nan") 
n3 = float("NaN") 
n4 = float("NAN") 
print(n1, n2, n3, n4)

nan nan nan nan

In [24]:
# Warning: Do not perform comparison between "NaN" values or "Nan" values and regular numbers. A simple or simplified reasoning is this: 
#Two things are "not a number", so they can be anything but most probably not the same. Above all there is no way of ordering NaNs:
print(n1 == n2) 
print(n1 == 0) 
print(n1 == 100) 
print(n2 < 0)

False
False
False
False

We will use now a data file similar to the previous temperature csv, but this time we will have to cope with NaN data, when the sensors malfunctioned. We will create a temperature DataFrame, in which some data is not defined, i.e. NaN. We will use and change the data from the the temperatures.csv file:

# USING DROPNA ON THE DATAFRAME 'dropna' is a DataFrame method. 
If we call this method without arguments, it will return an object where every row is ommitted, in which data are missing, i.e. some value is NaN:\
df = disturbed_data.dropna()\
'dropna' can also be used to drop all columns in which some values are NaN. This can be achieved by assigning 1 to the axis parameter. The default value is False, as we have seen in our previous example. As every column from our sensors contain NaN values, they will all disappear:
df = disturbed_data.dropna(axis=1)

df=df.dropna(inplace=True)

# thrash
Let us change our task: We only want to get rid of all the rows, which contain more than one NaN value. The parameter 'thresh' is ideal for this task. It can be set to the minimum number. 'thresh' is set to an integer value, which defines the minimum number of non-NaN values. 


cleansed_df = disturbed_data.dropna(thresh=5, axis=0) cleansed_df[:7]

# 7. binning in python

# 8. multi level indexing

In [84]:
import pandas as pd 
d = {"products": 
     ["Oppilume", "Dreaker", "Lotadilo", "Crosteron", "Wazzasoft", "Oppilume", "Dreaker", "Lotadilo", "Wazzasoft"], 
     "colours": 
     ["blue", "blue", "blue", "green", "blue", "green", "green", "green", "red"], 
     "customer_price": 
     [2345.89, 2390.50, 1820.00, 3100.00, 1784.50, 2545.89, 2590.50, 2220.00, 2084.50],
     "non_customer_price": 
     [2445.89, 2495.50, 1980.00, 3400.00, 1921.00, 2645.89,2655.50, 2140.00, 2190.00]} 
product_prices = pd.DataFrame(d) 
product_prices.set_index(['products','colours'],inplace=True)
product_prices.sort_index(inplace=True)
product_prices

                   customer_price  non_customer_price
products  colours
Crosteron green           3100.00             3400.00
Dreaker   blue            2390.50             2495.50
          green           2590.50             2655.50
Lotadilo  blue            1820.00             1980.00
          green           2220.00             2140.00
Oppilume  blue            2345.89             2445.89
          green           2545.89             2645.89
Wazzasoft blue            1784.50             1921.00
          red             2084.50             2190.00

# 9. PYTHON, DATE AND TIME
Python provides rich functionalities for dealing with date and time data. The standard libraries contains the modules \
• time \
• calendar \
• datetime \
These modules supply classes for manipulating dates and times in both simple and complex ways.\
The datetime module provides the following classes: • The instances of the date class represent dates, whereas the year can range between 1 and 9999. \
• The instances of the datetime class are made up both by a date and a time. \
• The time class implements time objects. \
• The timedelta class is used to hold the differences between two times or two date objects. \
• The tzinfo class is used to implement timezone support for time and datetime objects.

In [26]:
from datetime import date

In [35]:
l=date.today()
l

datetime.date(2024, 7, 31)

In [32]:
from datetime import date 
print(date.min) 
print(date.max)

0001-01-01
9999-12-31

In [37]:
p.weekday()

0

In [38]:
x=date(1778,5,11)
x

datetime.date(1778, 5, 11)

In [39]:
print(x.day) 
print(x.month) 
print(x.year)

11
5
1778

# THE TIME CLASS 
The time class is similarly organized than the date class.

In [40]:
from datetime import time

In [46]:
t=time(2, 10, 22)
t

datetime.time(2, 10, 22)

In [48]:
print(time.min) 
print(time.max)

00:00:00
23:59:59.999999

In [49]:
t.hour, t.minute, t.second

(2, 10, 22)

In [50]:
t = t.replace(hour=11, minute=59) 
t

datetime.time(11, 59, 22)

In [52]:
#We can render a date as a C-style like string, corresponding to the C ctime function:
x.ctime()

'Mon May 11 00:00:00 1778'

# DIFFERENCES BETWEEN TIMES 
Let's see what happens, if we subtract to datetime objects:

In [57]:
from datetime import datetime 
delta = datetime(1993, 12, 14) - datetime(1991, 4, 30) 
print(delta)
type(delta)
# We can get information about the number of days elapsed by using the attribute 'days':

959 days, 0:00:00

datetime.timedelta

In [72]:
delta.days, 
delta.months
# it seems it does not given the value of months and years but only days.

AttributeError: 'datetime.timedelta' object has no attribute 'months'

In [73]:
t1 = datetime(2017, 1, 31, 14, 17) 
t2 = datetime(2015, 12, 15, 16, 59) 
delta = t1 - t2 
delta.days, delta.seconds

(412, 76680)

In [74]:
# It is possible to add or subtract a timedelta to a datetime object to calculate a new datetime object by adding or subtracting the delta in days:
from datetime import datetime, timedelta 
d1 = datetime(1991, 4, 30) 
d2 = d1 + timedelta(10) 
print(d2) 
print(d2 - d1) 
d3 = d1 - timedelta(100) 
print(d3) 
d4 = d1 - 2 * timedelta(50) 
print(d4)

1991-05-10 00:00:00
10 days, 0:00:00
1991-01-20 00:00:00
1991-01-20 00:00:00

In [75]:
from datetime import datetime, timedelta 
d1 = datetime(1991, 4, 30) 
d2 = d1 + timedelta(10,100) 
print(d2) 
print(d2 - d1)

1991-05-10 00:01:40
10 days, 0:01:40

# converting given column of string into datetime

df['reservation_status_date']= pd.to_datetime(df['reservation_status_date'],format="mixed")

# CREATING DATETIME OBJECTS FROM STRINGS
We can use strptime to create new datetime object by parsing a string containing a data and time. The arguments of strptime are the string to be parsed and a format specification.

In [ ]:
from datetime import datetime 
t = datetime.strptime("30 Nov 00", "%d %b %y") 
print(t)

2000-11-30 00:00:00

In [60]:
dt = "2007-03-04T21:08:12" 
datetime.strptime( dt, "%Y-%m-%dT%H:%M:%S" )

datetime.datetime(2007, 3, 4, 21, 8, 12)

In [61]:
dt = '12/24/1957 4:03:29 AM' 
dt = datetime.strptime(dt, '%m/%d/%Y %I:%M:%S %p') 
dt

datetime.datetime(1957, 12, 24, 4, 3, 29)

In [62]:
dt = 'Wed Apr 12 20:29:53 CEST 2017' 
dt = datetime.strptime(dt, '%a %b %d %H:%M:%S %Z %Y') 
print(dt)

ValueError: time data 'Wed Apr 12 20:29:53 CEST 2017' does not match format '%a %b %d %H:%M:%S %Z %Y'

In [63]:
from dateutil.parser import parse 
parse('2011-01-03')

datetime.datetime(2011, 1, 3, 0, 0)

In [64]:
parse('Wed Apr 12 20:29:53 CEST 2017')

C:\Users\Education\AppData\Roaming\Python\Python312\site-packages\dateutil\parser\_parser.py:1207: UnknownTimezoneWarning: tzname CEST identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "

datetime.datetime(2017, 4, 12, 20, 29, 53)

# CONVERT DATETIME OBJECTS TO STRINGS 
The easiest way to convert a datetime object into a string consists in using str.

In [66]:
s = str(dt) 
s

'Wed Apr 12 20:29:53 CEST 2017'

# 10. PYTHON, PANDAS AND TIME SERIES
 Usually, a time series is a sequence of values, which are equally spaced points in time. Everything which consists of measured data connected with the corresponding time can be seen as a time series. Measurements can be taken irregularly, but in most cases time series consist of fixed frequencies. This means that data is measured or taken in a regular pattern, i.e. for example every 5 milliseconds, every 10 seconds, or very hour.

# 11 deleting columns

dataframe.drop(['A','B'], axis=1, inplace= True)

df.drop('B', axis=1, inplace=True)